---
title: "Pico ボードを WiFi ネットワークに接続! telnet サーバを動かして遠隔コマンド操作もしてみよう"
emoji: "🦁"
type: "tech" # tech: 技術記事 / idea: アイデア
topics: ["zennfes2025free", "raspberrypi", "pico", "raspberrypipico", "network"]
published: true
published_at: 2025-10-06 09:00
---
[pico-jxgLABO](https://zenn.dev/ypsitau/articles/2025-08-01-labo-intro) は、USB ケーブル一本でマイコンボード RaspberryPi Pico の様々な機能を試すことができる実験プラットフォームです。

今回は、pico-jxgLABO を使って Pico ボードを WiFi ネットワークに接続します。組込みマイコンのネットワーク接続というと、そのためのプログラムを書いて実行するというイメージが強いですが、pico-jxgLABO 環境では提供されているコマンドを実行するだけでネットワークが使えるようになります。

この記事で扱うネットワーク操作は以下の通りです。

- ネットワーク接続
  1. WiFi スキャンで利用可能なアクセスポイントを調べる
  2. 指定の SSID とパスワードで WiFi に接続する
  3. 固定 IP アドレスを設定する
- Pico ボード上でネットワークコマンド (ping, nslookup, ntp) を試してみる
- Pico ボード上で Telnet サーバを動かして遠隔コマンド操作をする

## Raspberry Pi Pico と WiFi 機能

### Pico W と Pico 2 W

Raspberry Pi Pico には Pico と Pico2 の二種類がありますが、どちらも WiFi 機能は搭載されていません。WiFi 機能を使うには、CYW43439 という WiFi チップ (以下 CYW43 チップ) を搭載した Pico W または Pico 2 W を使う必要があります。

![picow_pico2w](/images/2025-10-06-labo-wifi/picow_pico2w.jpg)
*Pico W と Pico 2 W*

Pico W は 1,200 円、Pico 2 W は 1,400 円程度で購入できます。WiFi 機能がない Pico ボードに比べて CYW43 チップの分だけ 400 円ほど高くなります。

ところで、CYW43 チップを制御するには Pico ボードで特殊用途向けに予約されている GPIO23, GPIO24, GPIO25, GPIO29 を使います。GPIO25 は、CYW43 チップを搭載していない Pico や Pico 2 では内蔵 LED の制御に使われますが、Pico W や Pico 2 W では CYW43 チップの制御に使われてしまいます。このため、内蔵 LED は CYW43 チップの GPIO に接続されており、これを制御するには CYW43 チップと通信する必要があります。これはかなり厄介な仕事です。Pico SDK ではこの内蔵 LED にアクセスするための API として `cyw43_arch_gpio_get()` と `cyw43_arch_gpio_put()` が用意しているので、これらを使うのが得策です。ところで、この限られた GPIO ピンで CYW43 チップを制御するのはずいぶん苦労したみたいです。[こちらの記事](https://zenn.dev/nonnoise/articles/0d5b97cb517e31)で詳しく解説されているので、興味のある方は読んでみてください。

限られた資源といえば、CYW43 チップの制御のために PIO (Programmable I/O) も使われています。Pico W は PIO1, PICO 2 W  は PIO2 を制御用に使っているので、PIO を使うプログラムを実行する場合は注意が必要です (pico-jxgLABO もロジアナ機能のために PIO を使います)。

### Pico のネットワーク機能の用途

Pico W や Pico 2 W の WiFi 機能は、IoT (Internet of Things) 機器のネットワーク接続に使う例が多いです。例えば、センサーで取得したデータをクラウドに送信したり、クラウドからの指示で機器を制御したりする用途です。HTTP プロトコルを使えば Web ブラウザで操作ができますし、MQTT プロトコルを使えば軽量なメッセージングが可能です。

今回の記事では、Pico ボードで telnet サーバを動かして pico-jxgLABO のシェルコマンドを遠隔で実行できるようにします。Tera Term などのターミナルソフトを使えば、Pico ボードを USB ケーブルで接続しなくてもコマンドを実行できるようになります。

以下の写真では、複数の Pico W や Pico 2 W を WiFi ネットワークに接続し、固定 IP アドレスをそれぞれ設定しています。

![wifi_experiment](/images/2025-10-06-labo-wifi/wifi-experiment.jpg)

物理的な配線をしなくてもそれぞれのボードにアクセスできるので、より自由な運用ができるようになりますね!

## pico-jxgLABO の書き込み

Pico ボードへの pico-jxgLABO の書き込みと基本的な使い方は[こちら](https://zenn.dev/ypsitau/articles/2025-08-01-labo-intro#pico-jxglabo-%E3%81%AE%E5%B0%8E%E5%85%A5%E6%96%B9%E6%B3%95)。特別なハードウェアは必要なく、Pico W や Pico 2 ボードを USB ケーブルで PC に接続するだけで始められます。

この記事で説明する実験を行うには、バージョン `0.3.0` 以降の pico-jxgLABO が Pico ボードに書き込まれている必要があります。ターミナルソフトで `about-me` コマンドを実行すると pico-jxgLABO のバージョンを確認できます。

```text
L:/>about-me
Program Information
 name:              pico-jxgLABO
 version:           0.3.0
     :
     :
```

## WiFi ネットワークに接続する

USB シリアルで Pico ボード上の pico-jxgLABO シェルに接続し、シェルコマンド `net` でネットワーク操作を行います。まずは `net wifi-scan` サブコマンドで利用可能なアクセスポイントを調べてみましょう。

```text
L:/>net wifi-scan
ssid:MyHome-WiFi                      rssi: -68 channel:  8 mac:xx:xx:xx:xx:xx:xx security:5
ssid:A12345678                        rssi: -75 channel: 11 mac:xx:xx:xx:xx:xx:xx security:7
ssid:LivingRoomAP                     rssi: -76 channel:  4 mac:xx:xx:xx:xx:xx:xx security:7
ssid:HUMIN-4512                       rssi: -76 channel:  4 mac:xx:xx:xx:xx:xx:xx security:7
```

`net wifi-connect` サブコマンドで SSID とパスワードを指定して WiFi に接続します。

```text
L:/>net wifi-connect {ssid:'MyHome-WiFi' password:'PASSWORD'}
Connected ssid:'MyHome-WiFi' auth:wpa2 addr:192.168.0.20 netmask:255.255.255.0 gateway:192.168.0.1
```

この例では DHCP で IP アドレスが `192.168.0.20` に設定されました。固定 IP アドレスを使いたい場合は、`net config` サブコマンドで IP アドレスを指定します。以下の例では IP アドレスを `192.168.0.101` に設定しています。

```text
L:/>net config {addr:192.168.0.101}
Connected ssid:'Buffalo-G-C5B8' auth:wpa2 addr:192.168.0.101 netmask:255.255.255.0 gateway:192.168.0.1
```

`config` サブコマンドはネットマスクとゲートウェイも指定できますが、これらは WiFi のアクセスポイントに接続した際に DHCP で与えられた値でないと通信できないので、通常は IP アドレスだけ指定することになると思います。

`wifi-connect` サブコマンドと `config` サブコマンドは組み合わせて使うこともできます。

```text
L:/>net wifi-connect {ssid:'MyHome-WiFi' password:'PASSWORD'} config {addr:192.168.0.101}
```

## ネットワークを使ってみる

### ネットワークコマンドの実行

まずは基本の `ping` コマンド。ゲートウェイに ping を送ってみます。

```text
L:/>ping 192.168.0.1
```

`nslookup` コマンドで DNS サーバに問い合わせてみます。

```text
L:/>nslookup www.raspberrypi.com
172.67.154.53
```

`ntp` コマンドで NTP サーバに接続して現在時刻を取得してみます。

```text
L:/>ntp
NTP time: 2025-10-06 12:34:56
```

### Pico ボード上で Telnet サーバを動かし、リモートでコマンドを実行する

`telnet-server` コマンドで Pico ボード上に telnet サーバを起動します。

```text
L:/>telnet-server start
Telnet server started on port 23
```

Tera Term を使って Pico ボードに接続してみましょう。Tera Term のメニューバーから `ファイル(F)` - `新しい接続(N)...` を実行して以下の「Tera Term: 新しい接続」ダイアログを表示します。

![teraterm-connect](/images/2025-10-06-labo-wifi/teraterm-connect.png)

`TCP/IP` を選択して `ホスト(T)` に Pico ボードの IP アドレスを入力、サービスに `Telnet` を選択して `OK` ボタンをクリックすると、新しい Tera Term のウィンドウが開き、ボードに接続します。パスワードを聞いてきますが、まだ設定していないのでそのまま Enter キーを押すとログインできます。

```text
password:
L:/>
```

これで pico-jxgLABO のコマンドがすべて遠隔で実行できるようになりました。[ロジックアナライザ機能](https://zenn.dev/ypsit/articles/2025-09-08-labo-la)もリモートで実行できるんですよ!

ちなみに、Telnet で接続すると USB シリアル通信は使えなくなります。Telnet を切断すると USB シリアル通信が再び使えるようになります。

ボードの制御ができることを確かめるために、見た目でわかりやすい LED 操作をしてみましょう。`led on` コマンドで Pico ボード上の LED を点灯させることができます。

```text
L:/>led on
```

`flip` サブコマンドを使うと、指定した間隔で LED の点灯・消灯を反転させることができます。以下は 100msec ごとに点滅させる例です。

```text
L:/>led on flip:100
```

以下の例は、50msec 点灯、500msec 消灯、50msec 点灯、500msec 消灯、50msec 点灯、2000msec 消灯を繰り返す点滅パターンです。

```text
L:/>led on flip:50,500,50,500,50,2000
```

反転操作の繰り返しを止めるには、`flip` サブコマンドの数値列の最後に `*` を指定します。以下は 3 回点灯した後に点滅を止める例です。

```text
L:/>led on flip:50,500,50,500,50,*
```

### パスワードの設定

パスワードを設定するには、`password` コマンドを実行します。パスワードは平文で保存されるのではなく、ハッシュ化されて保存されます。

```text
L:/>password
New password:
Reenter password:
password changed
```

`L:` ドライブのルートディレクトリに `.password` ファイルが作成され、ハッシュ化されたパスワードが保存されます。

パスワード入力は telnet 接続時に必要になります。USB シリアル接続時にはパスワード入力は必要ありません。

### 自動起動の設定

`L:` ドライブのルートディレクトリに `.startup` という名前のファイルを作成すると、Pico ボードの電源を入れたときに自動的に実行されるコマンドを設定できます。以下に WiFi 接続と telnet サーバの起動を自動化する例を示します。

```text:.startup
net --quiet wifi-connect {ssid:'SSID' password:'PASSWORD'} config {addr:XXX.XXX.XXX.XXX}
telnet-server --quiet start
led on flip:50,500,50,500,50,2000
```

すべてのコマンドが正常に実行されると、`led` コマンドで LED を点滅させて正常に起動したことを知らせます。設定した IP アドレスに応じて LED の点滅パターンを変えておくと、どのボードがどの IP アドレスに設定されているか一目でわかるので便利です。

## まとめ

pico-jxgLABO を使うと、Pico W や Pico 2 W の WiFi 機能を簡単に試すことができます。WiFi ネットワークに接続してネットワークコマンドを実行したり、telnet サーバを動かして遠隔でコマンド操作をしたりすることも可能です。
