---
title: "Pico ボードを WiFi ネットワークに接続して telnet で操作する"
emoji: "🦁"
type: "tech" # tech: 技術記事 / idea: アイデア
topics: ["zennfes2025free", "raspberrypi", "pico", "raspberrypipico", "network"]
published: false
---
[pico-jxgLABO](https://zenn.dev/ypsitau/articles/2025-08-01-labo-intro) は、USB ケーブル一本でマイコンボード RaspberryPi Pico の様々な機能を試すことができる実験プラットフォームです。

今回は、pico-jxgLABO を使って Pico ボードを WiFi ネットワークに接続します。組込みマイコンのネットワーク接続というと、そのためのプログラムを書いて実行するというイメージが強いですが、pico-jxgLABO 環境では提供されているコマンドを実行するだけでネットワークが使えるようになります。

この記事で扱うネットワーク操作は以下の通りです。

- ネットワーク接続
  1. WiFi スキャンで利用可能なアクセスポイントを調べる
  2. 指定の SSID とパスワードで WiFi に接続する
  3. 固定 IP アドレスを設定する
- Pico ボード上でネットワークコマンド (ping, nslookup, ntp) を試してみる
- Pico ボード上で Telnet サーバを動かし、リモートでコマンドを実行する

## Raspberry Pi Pico と WiFi 機能

### Pico W と Pico 2 W

Raspberry Pi Pico には Pico と Pico2 の二種類がありますが、どちらも WiFi 機能は搭載されていません。WiFi 機能を使うには、WiFi チップを搭載した Pico W または Pico 2 W を使う必要があります。

![picow_pico2w](/images/2025-10-06-labo-wifi/picow_pico2w.jpg)
*Pico W と Pico 2 W*

Pico W は 1,200 円、Pico 2 W は 1,400 円程度で購入できます。WiFi 機能がない Pico ボードに比べて WiFi チップの分だけ 400 円ほど高くなります。

ところで、WiFi チップを制御するには Pico ボードで特殊用途向けに予約されている GPIO23, GPIO24, GPIO25, GPIO29 を使うのですが、この限られたピンで WiFi チップを制御するのはずいぶん苦労したみたいです。[こちらの記事](https://zenn.dev/nonnoise/articles/0d5b97cb517e31)で詳しく解説されているので、興味のある方は読んでみてください。

限られた資源といえば、WiFi チップの制御のために PIO (Programmable I/O) も使われています。Pico W は PIO1, PICO 2 W  は PIO2 を制御用に使っているので、PIO を使うプログラムを実行する場合は注意が必要です (pico-jxgLABO もロジアナ機能のために PIO を使います)。

### Pico のネットワーク機能の用途

USB などのケーブルを使わずにネットワーク経由


![wifi_experiment](/images/2025-10-06-labo-wifi/wifi-experiment.jpg)

## pico-jxgLABO の書き込み

Pico ボードへの pico-jxgLABO の書き込みと基本的な使い方は[こちら](https://zenn.dev/ypsitau/articles/2025-08-01-labo-intro#pico-jxglabo-%E3%81%AE%E5%B0%8E%E5%85%A5%E6%96%B9%E6%B3%95)。特別なハードウェアは必要なく、Pico W や Pico 2 ボードを USB ケーブルで PC に接続するだけで始められます。

この記事で説明する実験を行うには、バージョン `0.3.0` 以降の pico-jxgLABO が Pico ボードに書き込まれている必要があります。ターミナルソフトで `about-me` コマンドを実行すると pico-jxgLABO のバージョンを確認できます。

```text
L:/>about-me
Program Information
 name:              pico-jxgLABO
 version:           0.3.0
     :
     :
```

## 実験

### ネットワーク接続

```text
L:/>net wifi-scan
```


```text
L:/>net wifi-connect {ssid:SSID password:PASSWORD}
```


192.168.0.XXX

```text
L:/>net config {addr:XXX.XXX.XXX.XXX}
```

```text
L:/>net wifi-connect {ssid:SSID password:PASSWORD} config {addr:XXX.XXX.XXX.XXX}
```

`config` サブコマンドはネットマスクとゲートウェイも指定できますが、WiFi のアクセスポイントに接続した際に DHCP で与えられた値でないとネットワークに接続できないので、通常は IP アドレスだけ指定することになると思います。

### ネットワークコマンドを試してみる

```text
L:/>ping 192.168.0.1
```

```text
L:/>nslookup www.raspberrypi.com
172.67.154.53
```

```text
L:/>ntp
NTP time: 2025-10-06 12:34:56
```


### Pico ボード上で Telnet サーバを動かし、リモートでコマンドを実行する

```text
L:/>telnet-server start
```

```text
L:/>password
```

